package com.example.admin.myretrofit;

/**
 * Created by fushuang on 2017/7/26.
 */

public class HeathBean {

    /**
     * error_code : 0
     * reason : Success!
     * result : {"count":1120,"description":"\u201d美国加州大学伯克利分校名誉教授、清华大学心理学系教授塞思·罗博斯告诉《生命时报》记者，他会在睡前练习单腿站立，这样晚上睡得更香，还能预防因睡眠问题引发的焦虑、抑郁以及心脏病、糖尿病、癌症等疾病","fcount":0,"id":5,"img":"http://imgs.juheapi.com/health_knowledge/598ef00a51981cb97b13656eb5294ced.jpg","keywords":"运动 健康 可以 睡眠 美国 ","loreclass":12,"rcount":0,"time":1438305228000,"title":"关注健康、珍爱健康是每个人一生的必修课","message":"<p>  <\/p> \n<p> 健康是最宝贵的财富，关注健康、珍爱健康是每个人一生的必修课。近日，美国\u201c健康\u201d网站刊文，总结出能为健康带来神奇变化的16件生活小事，《生命时报》记者就此采访多位国内专家为您详细解读。 <\/p> \n<p> <strong>饮食健康篇<\/strong> <\/p> \n<p> 水晾一天更好喝。用氯消毒灭菌，是很多自来水公司通行的做法。美国急诊医生珍妮弗·海恩斯认为，许多人不爱喝白开水，可能是因为水中有氯的味道。她建议，不妨把白开水放在大水杯里晾一整天，氯就会挥发掉，水会变得很甜，这样可以保证喝更多水。 <\/p> \n<p> 头天晚上准备早餐。《生命时报》发起的一项近8000人参与的调查显示，在不吃早饭的受访者中，30%是因为\u201c着急上班没时间\u201d。美国\u201c甜蜜食物\u201d网站主管卡洛琳·考夫曼建议：可以前一天晚上准备早餐。\u201c一般我会准备一碗燕麦，加入牛奶或酸奶，并撒上少许肉桂、草莓、樱桃等新鲜水果，然后放进冰箱。第二天一早，我就可以从容享用一份富含膳食纤维、蛋白质和抗氧化物的早餐了。\u201d <\/p> \n<p> 准备一个健康零食包。成功从200斤减到标准体重的艾米丽·桑福德在总结自己的减肥经验时指出：\u201c可以适当吃零食，但一定要有自己的健康零食包，比如我会在包里放一些无盐杏仁，可以在饿的时候吃几个。坚决不要吃别人的零食，以免摄入过多热量。\u201d <\/p> \n<p> 结账前整理购物车。超市里食物品种繁多，而且熟食往往香气诱人。因此，很多人在逛超市时会无意识地将熟食、零食、甜饮料等放进购物车。桑福德说：\u201c在结账前，我会看一下购物车，把不在购物清单上的东西放回货架。\u201d <\/p> \n<p> 坐飞机前少吃碳水化合物。健康博主汉斯博士说：\u201c坐飞机前吃加工过的碳水化合物，比如面包、面条等，会让人身体缺水，不利于健康。\u2018空中飞人\u2019们坐飞机前最好多吃水果蔬菜。\u201d <\/p> \n<p> <strong>运动生理篇<\/strong> <\/p> \n<p> 家门口摆双运动鞋。许多人回到家就陷进沙发里，忘记要出去运动。美国进化生物学家丽莎·凯恩说：\u201c我会在早上出门时，将运动鞋放在门口，这样下班一回家，鞋子就会提醒我该出去跑跑步了。\u201d同样，也可以把哑铃、瑜伽垫、扩胸器等运动器材放在家里显眼的位置，能时刻提醒我们运动。健康博主安吉拉·利登说：\u201c我总是把瑜伽垫放在电视机前，这样就可以一边看电视一边做瑜伽、仰卧起坐或俯卧撑了。\u201d <\/p> \n<p> 双腿微微分开坐。博金医生说：\u201c临床上，99%的髋膝关节疼痛患者都是女性。这是因为，女性为了保持矜持和优雅，通常被教导坐下时必须双腿并拢。根据人体力学，这样的坐姿会导致髂胫束（一条包绕大腿的深筋膜，是人体最长的肌腱）张力过大，导致髋关节和膝关节疼痛。因此，女性坐下时最好双腿稍微分开一点，以缓解肌腱张力。\u201d <\/p> \n<p> 刷牙时单腿站立。美国整形外科医生巴巴拉·博金建议：\u201c早晚刷牙时，不妨练习一下单腿站立，即用一条腿单独站立1分钟，然后换另一条腿。这个简单的小动作能提高你的平衡能力，有助于骨骼健康。\u201d美国加州大学伯克利分校名誉教授、清华大学心理学系教授塞思·罗博斯告诉《生命时报》记者，他会在睡前练习单腿站立，这样晚上睡得更香，还能预防因睡眠问题引发的焦虑、抑郁以及心脏病、糖尿病、癌症等疾病。 <\/p> \n<p> 站着接电话。权威医学杂志《柳叶刀》一项数据显示，全球有1/3的成年人\u201c懒得活动\u201d，导致每年约有500万人死亡。《生命时报》调查发现，八成国内受访者承认自己运动量不足。美国健身专家卡拉·伯恩伯格对此表示：\u201c要随时保持运动意识。比如接打电话时，我会站起来，到处溜达。每个人都可以利用各种机会增加运动量。\u201d <\/p> \n<p> 朋友互相监督做运动。每个人都有犯懒的时候，比如\u201c我今天工作太累了，明天再运动吧\u201d。但只要开了这么一个头，今后的借口就会越来越多，运动计划就会彻底\u201c流产\u201d。伯恩伯格说，随便做几个俯卧撑或到周围散散步，也比不运动要好，保持运动的习惯非常重要。可以跟朋友互相监督，比如在微博、微信朋友圈互相定时汇报每天的锻炼成果，有助于坚持运动。 <\/p> \n<p> <strong>心理睡眠篇<\/strong> <\/p> \n<p> 适当发发呆。快节奏的工作和生活常常让人精神萎靡、失眠、头痛、食欲不振等。心理健康博主洛丽·德斯坎建议：\u201c如果出现类似情况，就要赶紧问问自己：我现在想要的是什么，怎么做才能满足这种需求？比如感觉迟钝，就出门快走透透气；精神不集中时，不如闭上眼睛休息几分钟。\u201d广东省爱家心理研究所理事长马健文补充说，休息是为了走更远的路，身心需要定期保养，最好每周留出至少1小时的空白时间发发呆，让大脑不去工作。更重要的是，要学会有选择地接收与自身有关的信息。 <\/p> \n<p> 睡前做件让自己开心的事。塞思·罗博斯对《生命时报》记者表示，与美国人一样，中国人最普遍的心理问题就是睡眠质量差。为了克服睡眠不好的问题，健康博主珍妮·迪帕蒂从心态上做出调整：\u201c睡觉前可以做一件让自己开心的事，比如把卧室布置得特别温馨，或者穿上自己心爱的睡衣等，这有助于保持好的心情，可以促进睡眠。\u201d <\/p> \n<p> 在床上做放松训练。马健文建议，入睡困难的人，不妨在睡前试试行为疗法中的放松训练，十分有利于睡眠。朱莉·费根对此深有体会：\u201c每当睡不着时，我就会平躺在床上，专注于放松身体的每一块肌肉，将注意力依次集中在脚、小腿、膝盖、大腿、腹部、手臂、头部等，想象它们无比放松的感觉。\u201d <\/p> \n<p> 睡前洗个盐水浴。汉斯博士认为，睡前洗澡有助快速入眠。\u201c在睡觉前泡个澡，加入一些富含镁元素的浴盐，能放松肌肉。一周两到三次就可以帮助你睡得更好。\u201d <\/p> \n<p> 吃根香蕉助眠。塞思·罗博斯通过实验发现，睡前2小时左右吃根香蕉，或者喝少量(5～15毫升)蜂蜜，能改善心情，有助于睡眠。 <\/p> \n<p> 清晨享受阳光。健康博主赛兹莫尔·鲁伊斯博士指出，早上明媚的阳光会自然唤醒你的身体，告诉你现在是白天了，赶紧清醒起来吧。所以，清晨让全身都沐浴在阳光下，能提升一天的活力，改善心情，还有助于睡眠。 <\/p> \n<br>","status":true}
     */

    private int error_code;
    private String reason;
    private ResultBean result;

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public String getReason() {
        return reason;
    }

    public void setReason(String reason) {
        this.reason = reason;
    }

    public ResultBean getResult() {
        return result;
    }

    public void setResult(ResultBean result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * count : 1120
         * description : ”美国加州大学伯克利分校名誉教授、清华大学心理学系教授塞思·罗博斯告诉《生命时报》记者，他会在睡前练习单腿站立，这样晚上睡得更香，还能预防因睡眠问题引发的焦虑、抑郁以及心脏病、糖尿病、癌症等疾病
         * fcount : 0
         * id : 5
         * img : http://imgs.juheapi.com/health_knowledge/598ef00a51981cb97b13656eb5294ced.jpg
         * keywords : 运动 健康 可以 睡眠 美国
         * loreclass : 12
         * rcount : 0
         * time : 1438305228000
         * title : 关注健康、珍爱健康是每个人一生的必修课
         * message : <p>  </p>
         <p> 健康是最宝贵的财富，关注健康、珍爱健康是每个人一生的必修课。近日，美国“健康”网站刊文，总结出能为健康带来神奇变化的16件生活小事，《生命时报》记者就此采访多位国内专家为您详细解读。 </p>
         <p> <strong>饮食健康篇</strong> </p>
         <p> 水晾一天更好喝。用氯消毒灭菌，是很多自来水公司通行的做法。美国急诊医生珍妮弗·海恩斯认为，许多人不爱喝白开水，可能是因为水中有氯的味道。她建议，不妨把白开水放在大水杯里晾一整天，氯就会挥发掉，水会变得很甜，这样可以保证喝更多水。 </p>
         <p> 头天晚上准备早餐。《生命时报》发起的一项近8000人参与的调查显示，在不吃早饭的受访者中，30%是因为“着急上班没时间”。美国“甜蜜食物”网站主管卡洛琳·考夫曼建议：可以前一天晚上准备早餐。“一般我会准备一碗燕麦，加入牛奶或酸奶，并撒上少许肉桂、草莓、樱桃等新鲜水果，然后放进冰箱。第二天一早，我就可以从容享用一份富含膳食纤维、蛋白质和抗氧化物的早餐了。” </p>
         <p> 准备一个健康零食包。成功从200斤减到标准体重的艾米丽·桑福德在总结自己的减肥经验时指出：“可以适当吃零食，但一定要有自己的健康零食包，比如我会在包里放一些无盐杏仁，可以在饿的时候吃几个。坚决不要吃别人的零食，以免摄入过多热量。” </p>
         <p> 结账前整理购物车。超市里食物品种繁多，而且熟食往往香气诱人。因此，很多人在逛超市时会无意识地将熟食、零食、甜饮料等放进购物车。桑福德说：“在结账前，我会看一下购物车，把不在购物清单上的东西放回货架。” </p>
         <p> 坐飞机前少吃碳水化合物。健康博主汉斯博士说：“坐飞机前吃加工过的碳水化合物，比如面包、面条等，会让人身体缺水，不利于健康。‘空中飞人’们坐飞机前最好多吃水果蔬菜。” </p>
         <p> <strong>运动生理篇</strong> </p>
         <p> 家门口摆双运动鞋。许多人回到家就陷进沙发里，忘记要出去运动。美国进化生物学家丽莎·凯恩说：“我会在早上出门时，将运动鞋放在门口，这样下班一回家，鞋子就会提醒我该出去跑跑步了。”同样，也可以把哑铃、瑜伽垫、扩胸器等运动器材放在家里显眼的位置，能时刻提醒我们运动。健康博主安吉拉·利登说：“我总是把瑜伽垫放在电视机前，这样就可以一边看电视一边做瑜伽、仰卧起坐或俯卧撑了。” </p>
         <p> 双腿微微分开坐。博金医生说：“临床上，99%的髋膝关节疼痛患者都是女性。这是因为，女性为了保持矜持和优雅，通常被教导坐下时必须双腿并拢。根据人体力学，这样的坐姿会导致髂胫束（一条包绕大腿的深筋膜，是人体最长的肌腱）张力过大，导致髋关节和膝关节疼痛。因此，女性坐下时最好双腿稍微分开一点，以缓解肌腱张力。” </p>
         <p> 刷牙时单腿站立。美国整形外科医生巴巴拉·博金建议：“早晚刷牙时，不妨练习一下单腿站立，即用一条腿单独站立1分钟，然后换另一条腿。这个简单的小动作能提高你的平衡能力，有助于骨骼健康。”美国加州大学伯克利分校名誉教授、清华大学心理学系教授塞思·罗博斯告诉《生命时报》记者，他会在睡前练习单腿站立，这样晚上睡得更香，还能预防因睡眠问题引发的焦虑、抑郁以及心脏病、糖尿病、癌症等疾病。 </p>
         <p> 站着接电话。权威医学杂志《柳叶刀》一项数据显示，全球有1/3的成年人“懒得活动”，导致每年约有500万人死亡。《生命时报》调查发现，八成国内受访者承认自己运动量不足。美国健身专家卡拉·伯恩伯格对此表示：“要随时保持运动意识。比如接打电话时，我会站起来，到处溜达。每个人都可以利用各种机会增加运动量。” </p>
         <p> 朋友互相监督做运动。每个人都有犯懒的时候，比如“我今天工作太累了，明天再运动吧”。但只要开了这么一个头，今后的借口就会越来越多，运动计划就会彻底“流产”。伯恩伯格说，随便做几个俯卧撑或到周围散散步，也比不运动要好，保持运动的习惯非常重要。可以跟朋友互相监督，比如在微博、微信朋友圈互相定时汇报每天的锻炼成果，有助于坚持运动。 </p>
         <p> <strong>心理睡眠篇</strong> </p>
         <p> 适当发发呆。快节奏的工作和生活常常让人精神萎靡、失眠、头痛、食欲不振等。心理健康博主洛丽·德斯坎建议：“如果出现类似情况，就要赶紧问问自己：我现在想要的是什么，怎么做才能满足这种需求？比如感觉迟钝，就出门快走透透气；精神不集中时，不如闭上眼睛休息几分钟。”广东省爱家心理研究所理事长马健文补充说，休息是为了走更远的路，身心需要定期保养，最好每周留出至少1小时的空白时间发发呆，让大脑不去工作。更重要的是，要学会有选择地接收与自身有关的信息。 </p>
         <p> 睡前做件让自己开心的事。塞思·罗博斯对《生命时报》记者表示，与美国人一样，中国人最普遍的心理问题就是睡眠质量差。为了克服睡眠不好的问题，健康博主珍妮·迪帕蒂从心态上做出调整：“睡觉前可以做一件让自己开心的事，比如把卧室布置得特别温馨，或者穿上自己心爱的睡衣等，这有助于保持好的心情，可以促进睡眠。” </p>
         <p> 在床上做放松训练。马健文建议，入睡困难的人，不妨在睡前试试行为疗法中的放松训练，十分有利于睡眠。朱莉·费根对此深有体会：“每当睡不着时，我就会平躺在床上，专注于放松身体的每一块肌肉，将注意力依次集中在脚、小腿、膝盖、大腿、腹部、手臂、头部等，想象它们无比放松的感觉。” </p>
         <p> 睡前洗个盐水浴。汉斯博士认为，睡前洗澡有助快速入眠。“在睡觉前泡个澡，加入一些富含镁元素的浴盐，能放松肌肉。一周两到三次就可以帮助你睡得更好。” </p>
         <p> 吃根香蕉助眠。塞思·罗博斯通过实验发现，睡前2小时左右吃根香蕉，或者喝少量(5～15毫升)蜂蜜，能改善心情，有助于睡眠。 </p>
         <p> 清晨享受阳光。健康博主赛兹莫尔·鲁伊斯博士指出，早上明媚的阳光会自然唤醒你的身体，告诉你现在是白天了，赶紧清醒起来吧。所以，清晨让全身都沐浴在阳光下，能提升一天的活力，改善心情，还有助于睡眠。 </p>
         <br>
         * status : true
         */

        private int count;
        private String description;
        private int fcount;
        private int id;
        private String img;
        private String keywords;
        private int loreclass;
        private int rcount;
        private long time;
        private String title;
        private String message;
        private boolean status;

        public int getCount() {
            return count;
        }

        public void setCount(int count) {
            this.count = count;
        }

        public String getDescription() {
            return description;
        }

        public void setDescription(String description) {
            this.description = description;
        }

        public int getFcount() {
            return fcount;
        }

        public void setFcount(int fcount) {
            this.fcount = fcount;
        }

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getImg() {
            return img;
        }

        public void setImg(String img) {
            this.img = img;
        }

        public String getKeywords() {
            return keywords;
        }

        public void setKeywords(String keywords) {
            this.keywords = keywords;
        }

        public int getLoreclass() {
            return loreclass;
        }

        public void setLoreclass(int loreclass) {
            this.loreclass = loreclass;
        }

        public int getRcount() {
            return rcount;
        }

        public void setRcount(int rcount) {
            this.rcount = rcount;
        }

        public long getTime() {
            return time;
        }

        public void setTime(long time) {
            this.time = time;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getMessage() {
            return message;
        }

        public void setMessage(String message) {
            this.message = message;
        }

        public boolean isStatus() {
            return status;
        }

        public void setStatus(boolean status) {
            this.status = status;
        }
    }
}
